a1=0.62
a2=0.81
a3=0.96
a4=616000
a5=1.24
a6=1.65

t1=3.7
t2=9.4
t3=8.7
t4=0.00116
t5=19.1
t6=52

v1=a1*t1
v2=a2*t2
v3=a3*t3
v4=a4*t4
v5=a5*t5
v6=a6*t6

s1=a1*t1**2/2
s2=a2*t2**2/2
s3=a3*t3**2/2
s4=a4*t4**2/2
s5=a5*t5**2/2
s6=a6*t6**2/2

print("1. Лифт: v =", v1, "м/с, s =", s1, "м")
print("2. Трамвай: v =", v2, "м/с, s =", s2, "м")
print("3. Автомобиль: v =", v3, "м/с, s =", s3, "м")
print("4. Оқ: v =", v4, "м/с, s =", s4, "м")
print("5. Метро: v =", v5, "м/с, s =", s5, "м")
print("6. Ұшақ: v =", v6, "м/с, s =", s6, "м")